# <div style = "font-size : 42px; color : #000000 ; font-family : 'Oregon'; text-align : center; background-color : #dba514; border-radius: 5px 5px;"><strong>Bank Churn Prediction</strong></div>

## <div style = "font-size : 35px; color : #f9858b ; font-family : 'Calibri'; text-align : center; background-color : #bdfff6; border-radius: 5px 5px;"><strong>Fetching Data from MySQL Database</strong></div>

<div align="center">
  <img align = 'center' src="https://user-images.githubusercontent.com/58620359/174948746-5dc3418a-8296-4cc8-9561-f8f12ca9a0a4.png" alt="Project Banner" width="1000"/>
</div>

## Introduction
<div style="font-size: 16px; color: #ff9900; font-family: 'Comic Sans MS';">

In this notebook, we aim to demonstrate how to fetch data from a MySQL database using Python. This is a fundamental skill for data engineers and
analysts who need to interact with relational databases. We'll use libraries like `pandas` and `sqlalchemy` to connect to the database, execute SQL queries and save the dataframe in local machine in CSV format.

## About
<div style="font-size: 16px; color: #ff9900; font-family: 'Comic Sans MS';">

This notebook serves as a quick reference guide for fetching data from a MySQL database. It's particularly useful when you need to:
- Connect to a remote or local MySQL instance.
- Run basic SQL SELECT queries.
- Export the results into a pandas DataFrame.
- Save the DataFrame into CSV format for further analysis.

### Step 1: Import Required Libraries
We'll start by importing the necessary Python libraries.

In [1]:
# importing libraries
import os

import pandas as pd

from sqlalchemy import create_engine
from dotenv import load_dotenv

### Step 2: Load Environment Variables
Next, we'll load the environment variables that contain the database connection details. In this case, we're using a `.env` file to store the MySQL
engine URL.

In [2]:
# loading .env variables
load_dotenv()

MYSQL_ENGINE_URL = os.getenv('MYSQL_ENGINE_URL')

if MYSQL_ENGINE_URL:
    print('Loaded MYSQL_ENGINE_URL Successfully.')
else:
    print('Loaded MYSQL_ENGINE_URL Failure.')

Loaded MYSQL_ENGINE_URL Successfully.

### Step 3: Connect to the MySQL Database
Now, we'll create an engine object that allows us to connect to the MySQL database.

In [3]:
# Connecting mysql database
engine = create_engine(MYSQL_ENGINE_URL)
query = """SELECT * FROM bank_churn"""

### Step 4: Execute SQL Query and Fetch Data
We'll use the `pandas.read_sql()` function to execute the query and load the results into a DataFrame.

In [4]:
with engine.connect() as connection:
    data = pd.read_sql(query, connection)

data.head()

,id,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,0,15674932,Okwudilichukwu,668,France,Male,33.0,3,0.00,2,1.0,0.0,181449.97,0
1,1,15749177,Okwudiliolisa,627,France,Male,33.0,1,0.00,2,1.0,1.0,49503.50,0
2,2,15694510,Hsueh,678,France,Male,40.0,10,0.00,2,1.0,0.0,184866.69,0
3,3,15741417,Kao,581,France,Male,34.0,2,148882.54,1,1.0,1.0,84560.88,0
4,4,15766172,Chiemenam,716,Spain,Male,33.0,5,0.00,2,1.0,1.0,15068.83,0

### Step 5: Save data to CSV file
we'll use the `dataframe.to_csv()` function to save the data into CSV format in our local machine for further notebook experiments.

In [5]:
os.makedirs('data', exist_ok=True)
data.to_csv(os.path.join('data', 'bank_churn.csv'), index=False)

## Summary
<div style="font-size: 16px; color: #ff9900; font-family: 'Comic Sans MS';">

This notebook demonstrates how to:
- Import necessary libraries for database interaction.
- Load environment variables for database connectivity.
- Connect to a MySQL database using SQLAlchemy.
- Execute SQL queries and load results into a pandas DataFrame.
- Save the DataFrame into a CSV file for further analysis.